cmsis-svd/cmsis-svd/data/SiliconLabs/EFR32FG1P131F64GM32.svd
        <register>
          <name>IFC</name>
          <description>Interrupt Flag Clear Register</description>
          <addressOffset>0x020</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>UF</name>
              <description>Clear UF Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OF</name>
              <description>Clear OF Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DIRCNG</name>
              <description>Clear DIRCNG Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AUXOF</name>
              <description>Clear AUXOF Interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TCC</name>
              <description>Clear TCC Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OQSTERR</name>
              <description>Clear OQSTERR Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>UF</name>
              <description>UF Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OF</name>
              <description>OF Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIRCNG</name>
              <description>DIRCNG Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUXOF</name>
              <description>AUXOF Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCC</name>
              <description>TCC Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OQSTERR</name>
              <description>OQSTERR Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROUTELOC0</name>
          <description>I/O Routing Location Register</description>
          <addressOffset>0x02C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003F3F</resetMask>
          <fields>
            <field>
              <name>S0INLOC</name>
              <description>I/O Location</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOC0</name>
                  <description>Location 0</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC1</name>
                  <description>Location 1</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC2</name>
                  <description>Location 2</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC3</name>
                  <description>Location 3</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC4</name>
                  <description>Location 4</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC5</name>
                  <description>Location 5</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC6</name>
                  <description>Location 6</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC7</name>
                  <description>Location 7</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC8</name>
                  <description>Location 8</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC9</name>
                  <description>Location 9</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC10</name>
                  <description>Location 10</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC11</name>
                  <description>Location 11</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC12</name>
                  <description>Location 12</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC13</name>
                  <description>Location 13</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC14</name>
                  <description>Location 14</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC15</name>
                  <description>Location 15</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC16</name>
                  <description>Location 16</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC17</name>
                  <description>Location 17</description>
                  <value>0x00000011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC18</name>
                  <description>Location 18</description>
                  <value>0x00000012</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC19</name>
                  <description>Location 19</description>
                  <value>0x00000013</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC20</name>
                  <description>Location 20</description>
                  <value>0x00000014</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC21</name>
                  <description>Location 21</description>
                  <value>0x00000015</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC22</name>
                  <description>Location 22</description>
                  <value>0x00000016</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC23</name>
                  <description>Location 23</description>
                  <value>0x00000017</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC24</name>
                  <description>Location 24</description>
                  <value>0x00000018</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC25</name>
                  <description>Location 25</description>
                  <value>0x00000019</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC26</name>
                  <description>Location 26</description>
                  <value>0x0000001A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC27</name>
                  <description>Location 27</description>
                  <value>0x0000001B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC28</name>
                  <description>Location 28</description>
                  <value>0x0000001C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC29</name>
                  <description>Location 29</description>
                  <value>0x0000001D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC30</name>
                  <description>Location 30</description>
                  <value>0x0000001E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC31</name>
                  <description>Location 31</description>
                  <value>0x0000001F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S1INLOC</name>
              <description>I/O Location</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOC0</name>
                  <description>Location 0</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC1</name>
                  <description>Location 1</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC2</name>
                  <description>Location 2</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC3</name>
                  <description>Location 3</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC4</name>
                  <description>Location 4</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC5</name>
                  <description>Location 5</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC6</name>
                  <description>Location 6</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC7</name>
                  <description>Location 7</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC8</name>
                  <description>Location 8</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC9</name>
                  <description>Location 9</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC10</name>
                  <description>Location 10</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC11</name>
                  <description>Location 11</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC12</name>
                  <description>Location 12</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC13</name>
                  <description>Location 13</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC14</name>
                  <description>Location 14</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC15</name>
                  <description>Location 15</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC16</name>
                  <description>Location 16</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC17</name>
                  <description>Location 17</description>
                  <value>0x00000011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC18</name>
                  <description>Location 18</description>
                  <value>0x00000012</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC19</name>
                  <description>Location 19</description>
                  <value>0x00000013</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC20</name>
                  <description>Location 20</description>
                  <value>0x00000014</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC21</name>
                  <description>Location 21</description>
                  <value>0x00000015</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC22</name>
                  <description>Location 22</description>
                  <value>0x00000016</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC23</name>
                  <description>Location 23</description>
                  <value>0x00000017</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC24</name>
                  <description>Location 24</description>
                  <value>0x00000018</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC25</name>
                  <description>Location 25</description>
                  <value>0x00000019</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC26</name>
                  <description>Location 26</description>
                  <value>0x0000001A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC27</name>
                  <description>Location 27</description>
                  <value>0x0000001B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC28</name>
                  <description>Location 28</description>
                  <value>0x0000001C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC29</name>
                  <description>Location 29</description>
                  <value>0x0000001D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC30</name>
                  <description>Location 30</description>
                  <value>0x0000001E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC31</name>
                  <description>Location 31</description>
                  <value>0x0000001F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FREEZE</name>
          <description>Freeze Register</description>
          <addressOffset>0x040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>REGFREEZE</name>
              <description>Register Update Freeze</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCBUSY</name>
          <description>Synchronization Busy Register</description>
          <addressOffset>0x044</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>CTRL</name>
              <description>CTRL Register Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMD</name>
              <description>CMD Register Busy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOPB</name>
              <description>TOPB Register Busy</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVSCFG</name>
              <description>OVSCFG Register Busy</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXCNT</name>
          <description>Auxiliary Counter Value Register</description>
          <addressOffset>0x064</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>AUXCNT</name>
              <description>Auxiliary Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
